import { ReduxState } from '../assets/interface';

export const mockRedux: ReduxState = {
    Prefectures: {
        status: 'success',
        results: [
            {
                prefCode: 1,
                prefName: '北海道',
            },
            {
                prefCode: 2,
                prefName: '青森県',
            },
            {
                prefCode: 3,
                prefName: '岩手県',
            },
            {
                prefCode: 4,
                prefName: '宮城県',
            },
            {
                prefCode: 5,
                prefName: '秋田県',
            },
            {
                prefCode: 6,
                prefName: '山形県',
            },
            {
                prefCode: 7,
                prefName: '福島県',
            },
            {
                prefCode: 8,
                prefName: '茨城県',
            },
            {
                prefCode: 9,
                prefName: '栃木県',
            },
            {
                prefCode: 10,
                prefName: '群馬県',
            },
            {
                prefCode: 11,
                prefName: '埼玉県',
            },
            {
                prefCode: 12,
                prefName: '千葉県',
            },
            {
                prefCode: 13,
                prefName: '東京都',
            },
            {
                prefCode: 14,
                prefName: '神奈川県',
            },
            {
                prefCode: 15,
                prefName: '新潟県',
            },
            {
                prefCode: 16,
                prefName: '富山県',
            },
            {
                prefCode: 17,
                prefName: '石川県',
            },
            {
                prefCode: 18,
                prefName: '福井県',
            },
            {
                prefCode: 19,
                prefName: '山梨県',
            },
            {
                prefCode: 20,
                prefName: '長野県',
            },
            {
                prefCode: 21,
                prefName: '岐阜県',
            },
            {
                prefCode: 22,
                prefName: '静岡県',
            },
            {
                prefCode: 23,
                prefName: '愛知県',
            },
            {
                prefCode: 24,
                prefName: '三重県',
            },
            {
                prefCode: 25,
                prefName: '滋賀県',
            },
            {
                prefCode: 26,
                prefName: '京都府',
            },
            {
                prefCode: 27,
                prefName: '大阪府',
            },
            {
                prefCode: 28,
                prefName: '兵庫県',
            },
            {
                prefCode: 29,
                prefName: '奈良県',
            },
            {
                prefCode: 30,
                prefName: '和歌山県',
            },
            {
                prefCode: 31,
                prefName: '鳥取県',
            },
            {
                prefCode: 32,
                prefName: '島根県',
            },
            {
                prefCode: 33,
                prefName: '岡山県',
            },
            {
                prefCode: 34,
                prefName: '広島県',
            },
            {
                prefCode: 35,
                prefName: '山口県',
            },
            {
                prefCode: 36,
                prefName: '徳島県',
            },
            {
                prefCode: 37,
                prefName: '香川県',
            },
            {
                prefCode: 38,
                prefName: '愛媛県',
            },
            {
                prefCode: 39,
                prefName: '高知県',
            },
            {
                prefCode: 40,
                prefName: '福岡県',
            },
            {
                prefCode: 41,
                prefName: '佐賀県',
            },
            {
                prefCode: 42,
                prefName: '長崎県',
            },
            {
                prefCode: 43,
                prefName: '熊本県',
            },
            {
                prefCode: 44,
                prefName: '大分県',
            },
            {
                prefCode: 45,
                prefName: '宮崎県',
            },
            {
                prefCode: 46,
                prefName: '鹿児島県',
            },
            {
                prefCode: 47,
                prefName: '沖縄県',
            },
        ],
    },
    Population: {
        status: 'success',
        requestParams: {
            prefName: '宮崎県',
            prefCode: 45,
            cityCode: '-',
        },
        results: [
            {
                name: '栃木県',
                year: [
                    1960, 1965, 1970, 1975, 1980, 1985, 1990, 1995, 2000, 2005,
                    2010, 2015, 2020, 2025, 2030, 2035, 2040, 2045,
                ],
                data: [
                    1513624, 1521656, 1580021, 1698003, 1792201, 1866066,
                    1935168, 1984390, 2004817, 2016631, 2007683, 1974255,
                    1930235, 1872842, 1805949, 1730414, 1647288, 1560619,
                ],
                young: [
                    510097, 429447, 389016, 414123, 433232, 425807, 380087,
                    339253, 306905, 285245, 269823, 252836, 234328, 215694,
                    200974, 186959, 175984, 164918,
                ],
                adult: [
                    909207, 986774, 1069584, 1143083, 1191109, 1243861, 1315228,
                    1350635, 1352311, 1336513, 1281274, 1203616, 1138540,
                    1084830, 1031754, 969256, 883575, 812961,
                ],
                elderly: [
                    94320, 105435, 121421, 140651, 167438, 196328, 238505,
                    292947, 344506, 390896, 438196, 508392, 557367, 572318,
                    573221, 574199, 587729, 582740,
                ],
            },
            {
                name: '高知県',
                year: [
                    1960, 1965, 1970, 1975, 1980, 1985, 1990, 1995, 2000, 2005,
                    2010, 2015, 2020, 2025, 2030, 2035, 2040, 2045,
                ],
                data: [
                    854595, 812714, 786882, 808397, 831275, 839784, 825034,
                    816704, 813949, 796292, 764456, 728276, 691090, 652757,
                    614449, 575728, 536443, 498460,
                ],
                young: [
                    253081, 200055, 171991, 173005, 173649, 168580, 144276,
                    125833, 111740, 102421, 92798, 83884, 76335, 68775, 62306,
                    56380, 52105, 48198,
                ],
                adult: [
                    528882, 530837, 524918, 536129, 547780, 548167, 535995,
                    522208, 509050, 487367, 447540, 400605, 370062, 343706,
                    319382, 296169, 263431, 237246,
                ],
                elderly: [
                    72632, 81822, 89973, 98752, 109116, 121759, 141508, 167967,
                    191729, 206375, 218148, 237012, 244693, 240276, 232761,
                    223179, 220907, 213016,
                ],
            },
            {
                name: '宮崎県',
                year: [
                    1960, 1965, 1970, 1975, 1980, 1985, 1990, 1995, 2000, 2005,
                    2010, 2015, 2020, 2025, 2030, 2035, 2040, 2045,
                ],
                data: [
                    1134590, 1080692, 1051105, 1085055, 1151587, 1175543,
                    1168907, 1175819, 1170007, 1153042, 1135233, 1104069,
                    1066719, 1023170, 976626, 928034, 876863, 824806,
                ],
                young: [
                    405950, 335056, 278242, 265987, 273766, 270084, 239738,
                    210806, 187431, 169075, 158588, 149608, 142582, 132392,
                    122197, 112605, 104925, 97973,
                ],
                adult: [
                    661023, 668656, 684091, 716077, 757074, 764617, 761368,
                    760751, 740401, 712527, 680854, 622544, 573889, 532963,
                    500317, 471452, 432511, 397299,
                ],
                elderly: [
                    67617, 76980, 88772, 102923, 120638, 140747, 166539, 204222,
                    241754, 270586, 291301, 322975, 350248, 357815, 354112,
                    343977, 339427, 329534,
                ],
            },
        ],
    },
    _persist: {
        version: 1,
        rehydrated: true,
    },
};
